## Plan Result (prod-shutter)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Replace
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint.shutter_endpoint[&#34;vh-video-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-admin-web&#34;]
  * module.shutter.azurerm_cdn_endpoint_custom_domain.this[&#34;vh-video-web&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-admin-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-admin-sds-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-admin-web/endpoints/hmcts-admin-sds-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-admin-sds-shutter-prod" -> "hmcts-admin-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint.shutter_endpoint["vh-video-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint" "shutter_endpoint" {
      ~ content_types_to_compress     = [] -> (known after apply)
      ~ fqdn                          = "hmcts-video-sds-shutter-prod.azureedge.net" -> (known after apply)
      ~ id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-video-sds-shutter-prod" -> (known after apply)
      ~ name                          = "hmcts-video-sds-shutter-prod" -> "hmcts-video-shutter-prod" # forces replacement
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (8 unchanged attributes hidden)

      - timeouts {}

        # (1 unchanged block hidden)
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-admin-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint_custom_domain" "this" {
      ~ cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-admin-web/endpoints/hmcts-admin-sds-shutter-prod" # forces replacement -> (known after apply) # forces replacement
      ~ host_name       = "admin-sds.hearings.reform.hmcts.net" -> "admin.hearings.reform.hmcts.net" # forces replacement
      ~ id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-admin-web/endpoints/hmcts-admin-sds-shutter-prod/customDomains/admin-sds-hearings-reform-hmcts-net" -> (known after apply)
      ~ name            = "admin-sds-hearings-reform-hmcts-net" -> "admin-hearings-reform-hmcts-net" # forces replacement

      - user_managed_https {
          - key_vault_certificate_id = "https://acmedtssdsprod.vault.azure.net/certificates/wildcard-hearings-reform-hmcts-net" -> null
          - key_vault_secret_id      = "https://acmedtssdsprod.vault.azure.net/secrets/wildcard-hearings-reform-hmcts-net" -> null
          - tls_version              = "None" -> null
        }
    }

  # module.shutter.azurerm_cdn_endpoint_custom_domain.this["vh-video-web"] must be replaced
-/+ resource "azurerm_cdn_endpoint_custom_domain" "this" {
      ~ cdn_endpoint_id = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-video-sds-shutter-prod" # forces replacement -> (known after apply) # forces replacement
      ~ host_name       = "video-sds.hearings.reform.hmcts.net" -> "video.hearings.reform.hmcts.net" # forces replacement
      ~ id              = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-shutter-vh-video-web/endpoints/hmcts-video-sds-shutter-prod/customDomains/video-sds-hearings-reform-hmcts-net" -> (known after apply)
      ~ name            = "video-sds-hearings-reform-hmcts-net" -> "video-hearings-reform-hmcts-net" # forces replacement

      - user_managed_https {
          - key_vault_certificate_id = "https://acmedtssdsprod.vault.azure.net/certificates/wildcard-hearings-reform-hmcts-net" -> null
          - key_vault_secret_id      = "https://acmedtssdsprod.vault.azure.net/secrets/wildcard-hearings-reform-hmcts-net" -> null
          - tls_version              = "None" -> null
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":445,"Program":"tfcmt","SHA1":"","Target":"prod-shutter","Vars":{}} -->